test/minikube-overheads/results/aqua-postgres-sysbench/result
sysbench 1.0.20 (using system LuaJIT 2.1.1720049189)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            33516
        write:                           9576
        other:                           4788
        total:                           47880
    transactions:                        2394   (239.34 per sec.)
    queries:                             47880  (4786.86 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0019s
    total number of events:              2394

Latency (ms):
         min:                                    3.08
         avg:                                    4.18
         max:                                   11.71
         99th percentile:                        9.91
         sum:                                 9999.81

Threads fairness:
    events (avg/stddev):           2394.0000/0.00
    execution time (avg/stddev):   9.9998/0.00